fademike/fly_drone/stm32f103_FlyBoard/Src/VL53L0X.c
// Most of the functionality of this library is based on the VL53L0X API
// provided by ST (STSW-IMG005), and some of the explanatory comments are quoted
// or paraphrased from the API source code, API user manual (UM2039), and the
// VL53L0X datasheet.

#include <stdint.h>
#include "stm32f1xx_hal.h" // Change it for your requirements.
#include "string.h"
#include "VL53L0X.h"

//---------------------------------------------------------
// Local variables within this file (private)
//---------------------------------------------------------
uint8_t g_i2cAddr = ADDRESS_DEFAULT;
uint16_t g_ioTimeout = 0;  // no timeout
uint8_t g_isTimeout = 0;
uint16_t g_timeoutStartMs;
uint8_t g_stopVariable; // read by init and used when starting measurement; is StopVariable field of VL53L0X_DevData_t structure in API
uint32_t g_measTimBudUs;

#define I2C_TIMEOUT 10 // I2C timeout in ms
#define I2C_READ 1
#define I2C_WRITE 0


#define hi2cN hi2c2
//extern I2C_HandleTypeDef hi2cN;

#define VL53L0X_I2C_Handler hi2cN

extern I2C_HandleTypeDef VL53L0X_I2C_Handler; // I2C handler
uint8_t msgBuffer[4];
HAL_StatusTypeDef i2cStat;

//---------------------------------------------------------
// Locally used functions (private)
//---------------------------------------------------------
int getSpadInfo(uint8_t *count, bool *type_is_aperture);
void getSequenceStepEnables(SequenceStepEnables * enables);
void getSequenceStepTimeouts(SequenceStepEnables const * enables, SequenceStepTimeouts * timeouts);
bool performSingleRefCalibration(uint8_t vhv_init_byte);
static uint16_t decodeTimeout(uint16_t value);
static uint16_t encodeTimeout(uint16_t timeout_mclks);
static uint32_t timeoutMclksToMicroseconds(uint16_t timeout_period_mclks, uint8_t vcsel_period_pclks);
static uint32_t timeoutMicrosecondsToMclks(uint32_t timeout_period_us, uint8_t vcsel_period_pclks);

int statusVL53L0X = -1;

int vl53_getStatus(void){return statusVL53L0X;}
//---------------------------------------------------------
// I2C communication Functions
//---------------------------------------------------------
// Write an 8-bit register
#define writeReg(x,y) if (writeRegio(x,y) != HAL_OK) {statusVL53L0X = -1; return statusVL53L0X;}
int writeRegio(uint8_t reg, uint8_t value) {

  msgBuffer[0] = value; // Assign the value to the buffer.
  i2cStat = HAL_I2C_Mem_Write(&VL53L0X_I2C_Handler, g_i2cAddr | I2C_WRITE, reg, 1, msgBuffer, 1, I2C_TIMEOUT);
  return i2cStat;
}

// Write a 16-bit register
void writeReg16Bit(uint8_t reg, uint16_t value){

  memcpy(msgBuffer, &value, 2); // Assign the value to the buffer.
  i2cStat = HAL_I2C_Mem_Write(&VL53L0X_I2C_Handler, g_i2cAddr | I2C_WRITE, reg, 1, msgBuffer, 2, I2C_TIMEOUT);
}

// Write a 32-bit register
void writeReg32Bit(uint8_t reg, uint32_t value){

  memcpy(msgBuffer, &value, 4); // Assign the value to the buffer.
  i2cStat = HAL_I2C_Mem_Write(&VL53L0X_I2C_Handler, g_i2cAddr | I2C_WRITE, reg, 1, msgBuffer, 4, I2C_TIMEOUT);
}

// Read an 8-bit register
uint8_t readReg(uint8_t reg) {
  uint8_t value;

  i2cStat = HAL_I2C_Mem_Read(&VL53L0X_I2C_Handler, g_i2cAddr | I2C_READ, reg, 1, msgBuffer, 1, I2C_TIMEOUT);
  value = msgBuffer[0];

  return value;
}

// Read a 16-bit register
uint16_t readReg16Bit(uint8_t reg) {
  uint16_t value;

  i2cStat = HAL_I2C_Mem_Read(&VL53L0X_I2C_Handler, g_i2cAddr | I2C_READ, reg, 1, msgBuffer, 2, I2C_TIMEOUT);
  memcpy(&value, msgBuffer, 2);

  return value;
}

// Read a 32-bit register
uint32_t readReg32Bit(uint8_t reg) {
  uint32_t value;
  i2cStat = HAL_I2C_Mem_Read(&VL53L0X_I2C_Handler, g_i2cAddr | I2C_READ, reg, 1, msgBuffer, 4, I2C_TIMEOUT);
  memcpy(&value, msgBuffer, 4);

  return value;
}

// Write an arbitrary number of bytes from the given array to the sensor,
// starting at the given register
void writeMulti(uint8_t reg, uint8_t const *src, uint8_t count){

  memcpy(msgBuffer, src, 4);
  i2cStat = HAL_I2C_Mem_Write(&VL53L0X_I2C_Handler, g_i2cAddr | I2C_WRITE, reg, 1, msgBuffer, count, I2C_TIMEOUT);
}

// Read an arbitrary number of bytes from the sensor, starting at the given
// register, into the given array
void readMulti(uint8_t reg, uint8_t * dst, uint8_t count) {

	i2cStat = HAL_I2C_Mem_Read(&VL53L0X_I2C_Handler, g_i2cAddr | I2C_READ, reg, 1, dst, count, I2C_TIMEOUT);
}


// Public Methods //////////////////////////////////////////////////////////////

int setAddress_VL53L0X(uint8_t new_addr) {
  writeReg( I2C_SLAVE_DEVICE_ADDRESS, (new_addr>>1) & 0x7F );
  g_i2cAddr = new_addr;
}

uint8_t getAddress_VL53L0X() {
  return g_i2cAddr;
}

// Initialize sensor using sequence based on VL53L0X_DataInit(),
// VL53L0X_StaticInit(), and VL53L0X_PerformRefCalibration().
// This function does not perform reference SPAD calibration
// (VL53L0X_PerformRefSpadManagement()), since the API user manual says that it
// is performed by ST on the bare modules; it seems like that should work well
// enough unless a cover glass is added.
// If io_2v8 (optional) is true or not given, the sensor is configured for 2V8
// mode.
//bool initVL53L0X(bool io_2v8, I2C_HandleTypeDef *handler){
bool initVL53L0X(bool io_2v8){
  // VL53L0X_DataInit() begin

	  uint8_t spad_count;
	  bool spad_type_is_aperture;
	  if (statusVL53L0X == 0) return 0;
	if (statusVL53L0X>0){
//		static int last_st = 0;
//		static int cnt_last_st = 0;
//
//		if (last_st == statusVL53L0X) cnt_last_st++;
//		else cnt_last_st = 0;
//		last_st = statusVL53L0X;
//		if (cnt_last_st > 10) statusVL53L0X = -1;

		if (statusVL53L0X==1) goto init_pos_1;

		else if (statusVL53L0X==1) goto init_pos_1;
		else if (statusVL53L0X==(3)) goto init_pos_2;
		else if (statusVL53L0X==(5)) goto init_pos_3;
		else if (statusVL53L0X==(7)) goto init_pos_4;
		else if (statusVL53L0X==(9)) goto init_pos_5;
	}

  // Handler
  //memcpy(&VL53L0X_I2C_Handler, handler, sizeof(*handler));

  // Reset the message buffer.
  msgBuffer[0] = 0;
  msgBuffer[1] = 0;
  msgBuffer[2] = 0;
  msgBuffer[3] = 0;

  // sensor uses 1V8 mode for I/O by default; switch to 2V8 mode if necessary
  if (io_2v8)
  {
    writeReg(VHV_CONFIG_PAD_SCL_SDA__EXTSUP_HV,
      readReg(VHV_CONFIG_PAD_SCL_SDA__EXTSUP_HV) | 0x01); // set bit 0
  }

  // "Set I2C standard mode"
  writeReg(0x88, 0x00);

  writeReg(0x80, 0x01);
  writeReg(0xFF, 0x01);
  writeReg(0x00, 0x00);
  g_stopVariable = readReg(0x91);
  writeReg(0x00, 0x01);
  writeReg(0xFF, 0x00);
  writeReg(0x80, 0x00);

  // disable SIGNAL_RATE_MSRC (bit 1) and SIGNAL_RATE_PRE_RANGE (bit 4) limit checks
  writeReg(MSRC_CONFIG_CONTROL, readReg(MSRC_CONFIG_CONTROL) | 0x12);

  // set final range signal rate limit to 0.25 MCPS (million counts per second)
  setSignalRateLimit(0.25);

  writeReg(SYSTEM_SEQUENCE_CONFIG, 0xFF);

  // VL53L0X_DataInit() end

